LC2WithExtensionFilled/0/nut
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    atmosphereH
    {
        type            calculated;
        value           uniform 0;
    }
    
    atmosphereL
    {
        type            calculated;
        value           uniform 0;
    }
	
    defaultFaceL
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaceR
    {
        type            calculated;
        value           uniform 0;
    }
    gate
    {
        type            nutkRoughWallFunction;
        Ks              uniform .00100000000000000000;  // roughness height = sand-grain roughness (0 for smooth walls) [m]
        Cs              uniform 0.5;    // roughness constant, default 0.5
        value           uniform 0.0;
    }
    
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            nutkRoughWallFunction;
        Ks              uniform .00100000000000000000;  // roughness height = sand-grain roughness (0 for smooth walls) [m]
        Cs              uniform 0.5;    // roughness constant, default 0.5
        value           uniform 0.0;
    }
    
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    
}
